app/Controllers/TaskController.php

INSERT INTO `task` (`order`, `text`) VALUES ('36', 'ssssssss')
---
    public function SaveReorder()
    {
        $validation = \Config\Services::validation();
        $validation->setRule('order.*', 'ordre', 'required|numeric');
        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        } else {
            $orders = $this->request->getPost('order[]');
            $ids = $this->request->getPost('id[]');
            $index = 0;
            foreach ($ids as $id) {
                $form_data = [
                    'order' => $orders[$index],
                    'id'    => $ids[$index],
                ];
                $task = new Task($form_data);
                $this->taskModel->save($task);